results/after_10000/wrk_reactor_after_10000.txt
Server type: reactor


Running 10s test @ http://localhost:12345/
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   152.21ms  780.22ms  10.00s    96.65%
    Req/Sec     7.01k     6.21k   84.68k    84.82%
  Latency Distribution
     50%   23.46ms
     75%   31.80ms
     90%   37.66ms
     99%    4.77s 
  469805 requests in 10.08s, 1.36GB read
Requests/sec:  46623.05
Transfer/sec:    138.41MB

Running 10s test @ http://localhost:12345/
  8 threads and 25000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  Latency Distribution
     50%    0.00us
     75%    0.00us
     90%    0.00us
     99%    0.00us
  0 requests in 10.06s, 0.00B read
  Socket errors: connect 1031, read 32, write 0, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B

Running 10s test @ http://localhost:12345/
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   152.55ms  786.95ms  10.00s    96.64%
    Req/Sec     8.00k     5.79k   67.88k    79.04%
  Latency Distribution
     50%   21.98ms
     75%   28.97ms
     90%   36.69ms
     99%    4.83s 
  463731 requests in 10.08s, 1.34GB read
Requests/sec:  46000.51
Transfer/sec:    136.57MB

Running 10s test @ http://localhost:12345/
  8 threads and 25000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  Latency Distribution
     50%    0.00us
     75%    0.00us
     90%    0.00us
     99%    0.00us
  0 requests in 10.19s, 0.00B read
  Socket errors: connect 1323, read 0, write 0, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B

Running 10s test @ http://localhost:12345/
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   148.03ms  770.93ms  10.00s    96.72%
    Req/Sec     6.91k     7.59k   93.81k    86.17%
  Latency Distribution
     50%   20.37ms
     75%   30.19ms
     90%   38.71ms
     99%    4.70s 
  477790 requests in 10.09s, 1.39GB read
Requests/sec:  47348.78
Transfer/sec:    140.57MB

Running 10s test @ http://localhost:12345/
  8 threads and 25000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  Latency Distribution
     50%    0.00us
     75%    0.00us
     90%    0.00us
     99%    0.00us
  0 requests in 10.23s, 0.00B read
  Socket errors: connect 1188, read 0, write 0, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B

Running 10s test @ http://localhost:12345/
  8 threads and 15000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.83ms  547.60ms  10.00s    98.08%
    Req/Sec    16.51k    17.30k   73.88k    85.18%
  Latency Distribution
     50%   12.85ms
     75%   35.38ms
     90%   39.27ms
     99%    2.70s 
  699793 requests in 10.09s, 2.03GB read
  Socket errors: connect 0, read 41, write 0, timeout 0
Requests/sec:  69353.59
Transfer/sec:    205.90MB


Running 10s test @ http://localhost:12345/
  8 threads and 15000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    98.09ms  602.52ms  10.00s    97.83%
    Req/Sec    10.09k     7.34k   55.23k    79.44%
  Latency Distribution
     50%   21.72ms
     75%   31.27ms
     90%   38.43ms
     99%    3.30s 
  538402 requests in 10.09s, 1.56GB read
Requests/sec:  53350.02
Transfer/sec:    158.38MB


Running 10s test @ http://localhost:12345/
  8 threads and 15000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.24ms  566.34ms   9.99s    97.74%
    Req/Sec    11.75k    11.27k   50.10k    86.31%
  Latency Distribution
     50%   11.86ms
     75%   35.12ms
     90%   40.00ms
     99%    2.93s 
  642575 requests in 10.10s, 1.86GB read
Requests/sec:  63629.97
Transfer/sec:    188.90MB


Running 10s test @ http://localhost:12345/
  8 threads and 20000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    55.38ms  355.54ms   9.89s    98.94%
    Req/Sec    15.69k     8.75k   56.19k    76.39%
  Latency Distribution
     50%   27.52ms
     75%   30.43ms
     90%   31.72ms
     99%  585.77ms
  787871 requests in 10.09s, 2.28GB read
  Socket errors: connect 0, read 1575, write 0, timeout 0
Requests/sec:  78103.86
Transfer/sec:    231.87MB

Running 10s test @ http://localhost:12345/
  8 threads and 20000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    61.59ms  418.41ms   9.99s    98.56%
    Req/Sec    16.49k    13.15k   57.00k    59.49%
  Latency Distribution
     50%   19.78ms
     75%   22.25ms
     90%   24.23ms
     99%    1.65s 
  839412 requests in 10.10s, 2.43GB read
  Socket errors: connect 0, read 103, write 0, timeout 0
Requests/sec:  83135.72
Transfer/sec:    246.81MB

Running 10s test @ http://localhost:12345/
  8 threads and 20000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    51.39ms  280.81ms   9.62s    99.23%
    Req/Sec    13.02k     6.55k   56.11k    77.30%
  Latency Distribution
     50%   36.50ms
     75%   38.59ms
     90%   39.99ms
     99%   48.51ms
  748253 requests in 10.09s, 2.17GB read
  Socket errors: connect 0, read 1459, write 0, timeout 0
Requests/sec:  74121.16
Transfer/sec:    220.05MB

Running 10s test @ http://localhost:12345/
  8 threads and 25000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.66ms  302.53ms   9.89s    99.19%
    Req/Sec    21.19k    17.01k   65.85k    83.94%
  Latency Distribution
     50%   24.17ms
     75%   31.92ms
     90%   33.65ms
     99%   45.59ms
  697780 requests in 10.07s, 2.02GB read
Requests/sec:  69271.72
Transfer/sec:    205.65MB

Running 10s test @ http://localhost:12345/
  8 threads and 25000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    38.58ms  138.69ms   7.58s    99.71%
    Req/Sec    15.38k     8.97k   55.00k    72.43%
  Latency Distribution
     50%   35.99ms
     75%   43.12ms
     90%   44.73ms
     99%   49.03ms
  567030 requests in 10.10s, 1.64GB read
  Socket errors: connect 0, read 57, write 0, timeout 0
Requests/sec:  56156.13
Transfer/sec:    166.72MB

Running 10s test @ http://localhost:12345/
  8 threads and 25000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.51ms   77.37ms   4.57s    99.81%
    Req/Sec    15.52k    10.60k   50.85k    73.54%
  Latency Distribution
     50%   31.46ms
     75%   39.71ms
     90%   41.23ms
     99%   51.18ms
  607852 requests in 10.06s, 1.76GB read
Requests/sec:  60436.31
Transfer/sec:    179.42MB

Running 10s test @ http://localhost:12345/
  8 threads and 30000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.89ms   99.82ms   6.55s    99.88%
    Req/Sec    23.90k    13.04k   97.62k    87.15%
  Latency Distribution
     50%   28.70ms
     75%   35.90ms
     90%   41.30ms
     99%   65.26ms
  429712 requests in 12.45s, 1.25GB read
  Socket errors: connect 1763, read 18, write 0, timeout 0
Requests/sec:  34516.63
Transfer/sec:    102.47MB

Running 10s test @ http://localhost:12345/
  8 threads and 30000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.81ms  147.69ms   6.19s    99.32%
    Req/Sec    27.46k    12.91k   71.58k    75.00%
  Latency Distribution
     50%   19.65ms
     75%   28.76ms
     90%   34.21ms
     99%   60.50ms
  310006 requests in 10.82s, 0.90GB read
  Socket errors: connect 1390, read 1527, write 0, timeout 0
Requests/sec:  28664.19
Transfer/sec:     85.10MB

Running 10s test @ http://localhost:12345/
  8 threads and 30000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.46ms   92.55ms   6.23s    99.50%
    Req/Sec    24.14k    10.02k   63.33k    75.00%
  Latency Distribution
     50%   29.14ms
     75%   36.96ms
     90%   44.19ms
     99%   65.26ms
  378158 requests in 10.84s, 1.10GB read
  Socket errors: connect 1159, read 1234, write 0, timeout 0
Requests/sec:  34877.90
Transfer/sec:    103.55MB